documentation updated for lab09
